Revit 2027 API
ImageTypeSource Enumeration
 The source of the data used to generate the image.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ImageTypeSource
Public Enumeration ImageTypeSource
public enum class ImageTypeSource
type ImageTypeSource
Members
Member name | Value | Description
Import | 1 |  The image data was imported into the Revit document.
Internal | 2 |  The image data was created internally. These are rendering images or views saved in the project as images.
Link | 0 |  The image data is from an externally linked image file.
See Also
Reference
Autodesk.Revit.DB Namespace